# 2024 week 2: Average Price Analysis

https://preppindata.blogspot.com/2024/01/2024-week-2-average-price-analysis.html

## Solution

In [1]:
import pandas as pd
pd.options.mode.copy_on_write = True

In [2]:
flow_card_yes = pd.read_csv("data/input_flow_card_yes.csv", parse_dates=["Date"], date_format="%d/%m/%Y")
flow_card_yes.head()

,Date,Flight Number,From,To,Class,Price,Flow Card?,Bags Checked,Meal Type
0,2024-07-22,PA010,Tokyo,New York,Economy,2380.0,Yes,0,Egg Free
1,2024-04-20,PA002,New York,London,Economy,3490.0,Yes,1,Vegan
2,2024-01-23,PA010,Tokyo,New York,Premium Economy,825.0,Yes,1,Vegetarian
3,2024-06-05,PA006,Tokyo,London,First Class,618.0,Yes,3,Vegan
4,2024-03-30,PA004,Perth,London,First Class,446.0,Yes,1,Nut Free

In [3]:
flow_card_no = pd.read_csv("data/input_flow_card_no.csv", parse_dates=["Date"], date_format="%d/%m/%Y")
flow_card_no.head()

,Date,Flight Number,From,To,Class,Price,Flow Card?,Bags Checked,Meal Type
0,2024-09-28,PA008,Perth,New York,Economy,1855.0,No,2,Vegetarian
1,2024-10-01,PA008,Perth,New York,Business Class,634.8,No,0,Vegetarian
2,2024-03-04,PA007,New York,Perth,Business Class,458.4,No,3,Nut Free
3,2024-02-25,PA010,Tokyo,New York,Premium Economy,1435.0,No,0,NaN
4,2024-03-29,PA004,Perth,London,Economy,2730.0,No,2,Vegan

In [4]:
# Union the two input files
df = pd.concat((flow_card_yes, flow_card_no))
df

,Date,Flight Number,From,To,Class,Price,Flow Card?,Bags Checked,Meal Type
0,2024-07-22,PA010,Tokyo,New York,Economy,2380.0,Yes,0,Egg Free
1,2024-04-20,PA002,New York,London,Economy,3490.0,Yes,1,Vegan
2,2024-01-23,PA010,Tokyo,New York,Premium Economy,825.0,Yes,1,Vegetarian
3,2024-06-05,PA006,Tokyo,London,First Class,618.0,Yes,3,Vegan
4,2024-03-30,PA004,Perth,London,First Class,446.0,Yes,1,Nut Free
...,...,...,...,...,...,...,...,...,...
1890,2024-03-06,PA006,Tokyo,London,Premium Economy,940.0,No,2,Vegetarian
1891,2024-05-05,PA009,New York,Tokyo,Economy,1360.0,No,3,Nut Free
1892,2024-06-14,PA008,Perth,New York,First Class,245.0,No,1,Dairy Free
1893,2024-01-16,PA010,Tokyo,New York,Economy,2410.0,No,2,Egg Free
1894,2024-08-16,PA005,London,Tokyo,Premium Economy,960.0,No,0,Nut Free

In [5]:
df["Quarter"] = df["Date"].dt.quarter
df.head()

,Date,Flight Number,From,To,Class,Price,Flow Card?,Bags Checked,Meal Type,Quarter
0,2024-07-22,PA010,Tokyo,New York,Economy,2380.0,Yes,0,Egg Free,3
1,2024-04-20,PA002,New York,London,Economy,3490.0,Yes,1,Vegan,2
2,2024-01-23,PA010,Tokyo,New York,Premium Economy,825.0,Yes,1,Vegetarian,1
3,2024-06-05,PA006,Tokyo,London,First Class,618.0,Yes,3,Vegan,2
4,2024-03-30,PA004,Perth,London,First Class,446.0,Yes,1,Nut Free,1

In [6]:
# Aggregate by various fields
grouped = df.groupby(["Flow Card?", "Quarter", "Class"], as_index=False)

In [7]:
# Calculate median prices by group
median_prices_by_group = grouped["Price"].median()
median_prices_by_group

   Flow Card?  Quarter            Class    Price
0          No        1   Business Class   574.80
1          No        1          Economy  2340.00
2          No        1      First Class   438.00
3          No        1  Premium Economy  1075.00
4          No        2   Business Class   553.80
5          No        2          Economy  2325.00
6          No        2      First Class   445.00
7          No        2  Premium Economy  1205.00
8          No        3   Business Class   490.80
9          No        3          Economy  2285.00
10         No        3      First Class   487.00
11         No        3  Premium Economy  1125.00
12         No        4   Business Class   555.60
13         No        4          Economy  2202.50
14         No        4      First Class   428.00
15         No        4  Premium Economy  1062.50
16        Yes        1   Business Class   523.20
17        Yes        1          Economy  2325.00
18        Yes        1      First Class   447.50
19        Yes        1  Premium Economy  1160.00
20        Yes        2   Business Class   517.80
21        Yes        2          Economy  2290.00
22        Yes        2      First Class   459.00
23        Yes        2  Premium Economy  1071.25
24        Yes        3   Business Class   553.80
25        Yes        3          Economy  2347.50
26        Yes        3      First Class   457.00
27        Yes        3  Premium Economy  1090.00
28        Yes        4   Business Class   522.60
29        Yes        4          Economy  2212.50
30        Yes        4      First Class   424.00
31        Yes        4  Premium Economy  1108.75

In [8]:
# Calculate minimum prices by group
minimum_prices_by_group = grouped["Price"].min()
minimum_prices_by_group

   Flow Card?  Quarter            Class   Price
0          No        1   Business Class   241.2
1          No        1          Economy  1030.0
2          No        1      First Class   204.0
3          No        1  Premium Economy   515.0
4          No        2   Business Class   240.0
5          No        2          Economy  1000.0
6          No        2      First Class   202.0
7          No        2  Premium Economy   507.5
8          No        3   Business Class   240.0
9          No        3          Economy  1000.0
10         No        3      First Class   201.0
11         No        3  Premium Economy   517.5
12         No        4   Business Class   240.0
13         No        4          Economy  1015.0
14         No        4      First Class   200.0
15         No        4  Premium Economy   510.0
16        Yes        1   Business Class   249.6
17        Yes        1          Economy  1020.0
18        Yes        1      First Class   201.0
19        Yes        1  Premium Economy   502.5
20        Yes        2   Business Class   240.0
21        Yes        2          Economy  1020.0
22        Yes        2      First Class   200.0
23        Yes        2  Premium Economy   500.0
24        Yes        3   Business Class   241.2
25        Yes        3          Economy  1005.0
26        Yes        3      First Class   206.0
27        Yes        3  Premium Economy   502.5
28        Yes        4   Business Class   249.6
29        Yes        4          Economy  1030.0
30        Yes        4      First Class   205.0
31        Yes        4  Premium Economy   505.0

In [9]:
# Calculate maximum prices by group
maximum_prices_by_group = grouped["Price"].max()
maximum_prices_by_group

   Flow Card?  Quarter            Class   Price
0          No        1   Business Class   834.0
1          No        1          Economy  3455.0
2          No        1      First Class   699.0
3          No        1  Premium Economy  1702.5
4          No        2   Business Class   828.0
5          No        2          Economy  3480.0
6          No        2      First Class   694.0
7          No        2  Premium Economy  1745.0
8          No        3   Business Class   838.8
9          No        3          Economy  3475.0
10         No        3      First Class   691.0
11         No        3  Premium Economy  1747.5
12         No        4   Business Class   835.2
13         No        4          Economy  3465.0
14         No        4      First Class   698.0
15         No        4  Premium Economy  1730.0
16        Yes        1   Business Class   840.0
17        Yes        1          Economy  3500.0
18        Yes        1      First Class   698.0
19        Yes        1  Premium Economy  1737.5
20        Yes        2   Business Class   840.0
21        Yes        2          Economy  3490.0
22        Yes        2      First Class   696.0
23        Yes        2  Premium Economy  1737.5
24        Yes        3   Business Class   840.0
25        Yes        3          Economy  3495.0
26        Yes        3      First Class   697.0
27        Yes        3  Premium Economy  1750.0
28        Yes        4   Business Class   834.0
29        Yes        4          Economy  3460.0
30        Yes        4      First Class   697.0
31        Yes        4  Premium Economy  1722.5

In [10]:
# Pivot on `Class` field
median_prices_by_group_pivoted = median_prices_by_group.pivot(
    columns="Class", index=["Flow Card?", "Quarter"], values="Price"
).reset_index().rename_axis(columns=None)
median_prices_by_group_pivoted

  Flow Card?  Quarter  Business Class  Economy  First Class  Premium Economy
0         No        1           574.8   2340.0        438.0          1075.00
1         No        2           553.8   2325.0        445.0          1205.00
2         No        3           490.8   2285.0        487.0          1125.00
3         No        4           555.6   2202.5        428.0          1062.50
4        Yes        1           523.2   2325.0        447.5          1160.00
5        Yes        2           517.8   2290.0        459.0          1071.25
6        Yes        3           553.8   2347.5        457.0          1090.00
7        Yes        4           522.6   2212.5        424.0          1108.75

In [11]:
# Pivot on `Class` field
minimum_prices_by_group_pivoted = minimum_prices_by_group.pivot(
    columns="Class", index=["Flow Card?", "Quarter"], values="Price"
).reset_index().rename_axis(columns=None)
minimum_prices_by_group_pivoted

  Flow Card?  Quarter  Business Class  Economy  First Class  Premium Economy
0         No        1           241.2   1030.0        204.0            515.0
1         No        2           240.0   1000.0        202.0            507.5
2         No        3           240.0   1000.0        201.0            517.5
3         No        4           240.0   1015.0        200.0            510.0
4        Yes        1           249.6   1020.0        201.0            502.5
5        Yes        2           240.0   1020.0        200.0            500.0
6        Yes        3           241.2   1005.0        206.0            502.5
7        Yes        4           249.6   1030.0        205.0            505.0

In [12]:
# Pivot on `Class` field
maximum_prices_by_group_pivoted = maximum_prices_by_group.pivot(
    columns="Class", index=["Flow Card?", "Quarter"], values="Price"
).reset_index().rename_axis(columns=None)
maximum_prices_by_group_pivoted

  Flow Card?  Quarter  Business Class  Economy  First Class  Premium Economy
0         No        1           834.0   3455.0        699.0           1702.5
1         No        2           828.0   3480.0        694.0           1745.0
2         No        3           838.8   3475.0        691.0           1747.5
3         No        4           835.2   3465.0        698.0           1730.0
4        Yes        1           840.0   3500.0        698.0           1737.5
5        Yes        2           840.0   3490.0        696.0           1737.5
6        Yes        3           840.0   3495.0        697.0           1750.0
7        Yes        4           834.0   3460.0        697.0           1722.5

In [13]:
# Union all data
df = pd.concat(
    (
        median_prices_by_group_pivoted,
        minimum_prices_by_group_pivoted,
        maximum_prices_by_group_pivoted,
    )
).reset_index(drop=True)
df

   Flow Card?  Quarter  Business Class  Economy  First Class  Premium Economy
0          No        1           574.8   2340.0        438.0          1075.00
1          No        2           553.8   2325.0        445.0          1205.00
2          No        3           490.8   2285.0        487.0          1125.00
3          No        4           555.6   2202.5        428.0          1062.50
4         Yes        1           523.2   2325.0        447.5          1160.00
5         Yes        2           517.8   2290.0        459.0          1071.25
6         Yes        3           553.8   2347.5        457.0          1090.00
7         Yes        4           522.6   2212.5        424.0          1108.75
8          No        1           241.2   1030.0        204.0           515.00
9          No        2           240.0   1000.0        202.0           507.50
10         No        3           240.0   1000.0        201.0           517.50
11         No        4           240.0   1015.0        200.0           510.00
12        Yes        1           249.6   1020.0        201.0           502.50
13        Yes        2           240.0   1020.0        200.0           500.00
14        Yes        3           241.2   1005.0        206.0           502.50
15        Yes        4           249.6   1030.0        205.0           505.00
16         No        1           834.0   3455.0        699.0          1702.50
17         No        2           828.0   3480.0        694.0          1745.00
18         No        3           838.8   3475.0        691.0          1747.50
19         No        4           835.2   3465.0        698.0          1730.00
20        Yes        1           840.0   3500.0        698.0          1737.50
21        Yes        2           840.0   3490.0        696.0          1737.50
22        Yes        3           840.0   3495.0        697.0          1750.00
23        Yes        4           834.0   3460.0        697.0          1722.50

In [14]:
# Rename and reorder columns
df = df.rename(
    columns={
        "Economy": "First",
        "First Class": "Economy",
        "Business Class": "Premium",
        "Premium Economy": "Business",
    }
)
sort_columns = [
    "Flow Card?",
    "Quarter",
    "Economy",
    "Premium",
    "Business",
    "First",
]
df = df[sort_columns].sort_values(sort_columns).reset_index(drop=True)
df

   Flow Card?  Quarter  Economy  Premium  Business   First
0          No        1    204.0    241.2    515.00  1030.0
1          No        1    438.0    574.8   1075.00  2340.0
2          No        1    699.0    834.0   1702.50  3455.0
3          No        2    202.0    240.0    507.50  1000.0
4          No        2    445.0    553.8   1205.00  2325.0
5          No        2    694.0    828.0   1745.00  3480.0
6          No        3    201.0    240.0    517.50  1000.0
7          No        3    487.0    490.8   1125.00  2285.0
8          No        3    691.0    838.8   1747.50  3475.0
9          No        4    200.0    240.0    510.00  1015.0
10         No        4    428.0    555.6   1062.50  2202.5
11         No        4    698.0    835.2   1730.00  3465.0
12        Yes        1    201.0    249.6    502.50  1020.0
13        Yes        1    447.5    523.2   1160.00  2325.0
14        Yes        1    698.0    840.0   1737.50  3500.0
15        Yes        2    200.0    240.0    500.00  1020.0
16        Yes        2    459.0    517.8   1071.25  2290.0
17        Yes        2    696.0    840.0   1737.50  3490.0
18        Yes        3    206.0    241.2    502.50  1005.0
19        Yes        3    457.0    553.8   1090.00  2347.5
20        Yes        3    697.0    840.0   1750.00  3495.0
21        Yes        4    205.0    249.6    505.00  1030.0
22        Yes        4    424.0    522.6   1108.75  2212.5
23        Yes        4    697.0    834.0   1722.50  3460.0

## Tests

In [15]:
import pandas.testing as pdt

In [16]:
expected_output = pd.read_csv("data/output.csv").sort_values(sort_columns).reset_index(drop=True)

In [17]:
pdt.assert_frame_equal(expected_output, df, check_dtype=False)